Revit 2027 API
TableSectionData.IsAcceptableParamIdAndCategoryId(ElementId, ElementId) Method
 Identifies if the given parameter id and category id can be assigned to a cell in this table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAcceptableParamIdAndCategoryId(
	ElementId paramId,
	ElementId categoryId
)
Public Function IsAcceptableParamIdAndCategoryId (
	paramId As ElementId,
	categoryId As ElementId
) As Boolean
public:
bool IsAcceptableParamIdAndCategoryId(
	ElementId^ paramId,
	ElementId^ categoryId
)
member IsAcceptableParamIdAndCategoryId :
        paramId : ElementId *
        categoryId : ElementId -> bool
Parameters
paramId ElementId
categoryId ElementId
Return Value
Boolean
 True if the ParamId and CategoryId are all acceptable.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
IsAcceptableParamIdAndCategoryId Overload
Autodesk.Revit.DB Namespace